-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Фев 06 2020 г., 15:27
-- Версия сервера: 10.3.16-MariaDB
-- Версия PHP: 7.3.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `weather`
--

-- --------------------------------------------------------

--
-- Структура таблицы `forecast`
--

CREATE TABLE `forecast` (
  `dt_txt` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `temperature` float NOT NULL,
  `icon` text COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `forecast`
--

INSERT INTO `forecast` (`dt_txt`, `temperature`, `icon`) VALUES
('2020-02-06 15:00:00', -0.82, '04n'),
('2020-02-06 18:00:00', -1.09, '04n'),
('2020-02-06 21:00:00', -0.57, '13n'),
('2020-02-07 00:00:00', 0.41, '13n'),
('2020-02-07 03:00:00', -3.74, '04n'),
('2020-02-07 06:00:00', -5.01, '04d'),
('2020-02-07 09:00:00', -3.28, '04d'),
('2020-02-07 12:00:00', -3.04, '04d'),
('2020-02-07 15:00:00', -3.63, '13n'),
('2020-02-07 18:00:00', -5.05, '13n'),
('2020-02-07 21:00:00', -5.51, '02n'),
('2020-02-08 00:00:00', -5.82, '04n'),
('2020-02-08 03:00:00', -6.69, '04n'),
('2020-02-08 06:00:00', -6.73, '04d'),
('2020-02-08 09:00:00', -5.23, '04d'),
('2020-02-08 12:00:00', -3.45, '04d'),
('2020-02-08 15:00:00', -4.52, '01n'),
('2020-02-08 18:00:00', -5.23, '01n'),
('2020-02-08 21:00:00', -5.81, '01n'),
('2020-02-09 00:00:00', -6.07, '01n'),
('2020-02-09 03:00:00', -6.11, '01n'),
('2020-02-09 06:00:00', -5.48, '01d'),
('2020-02-09 09:00:00', -2.17, '01d'),
('2020-02-09 12:00:00', -0.36, '01d'),
('2020-02-09 15:00:00', -2.05, '01d'),
('2020-02-09 18:00:00', -2.86, '01n'),
('2020-02-09 21:00:00', -3.35, '01n'),
('2020-02-10 00:00:00', -3.51, '01n'),
('2020-02-10 03:00:00', -3.44, '01n'),
('2020-02-10 06:00:00', -2.86, '01d'),
('2020-02-10 09:00:00', 1.36, '02d'),
('2020-02-10 12:00:00', 3.33, '03d'),
('2020-02-10 15:00:00', 2.03, '04d'),
('2020-02-10 18:00:00', 2.16, '04n'),
('2020-02-10 21:00:00', 0.91, '04n'),
('2020-02-11 00:00:00', 0.31, '10n'),
('2020-02-11 03:00:00', 2.83, '10n'),
('2020-02-11 06:00:00', 2.34, '04d'),
('2020-02-11 09:00:00', 4.2, '04d'),
('2020-02-11 12:00:00', 5.37, '03d');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
